--PhÇn th­ëng D· TÈu
-- 28/3/2021
Include("\\script\\event\\dropper.lua");
Include("\\script\\awards\\stackaw.lua");
Include("\\script\\event\\30042026\\header.lua");

--B¶ng vËt phÈm th­ëng ngÉu nhiªn khi hoµn thµnh nv;
--cét cuèi: cµng cao cµng khã gÆp
--cét kÕ cuèi: lµm ®ñ sè nhiÖm vô liªn tiÕp th× míi cã c¬ héi ®c vµo random
DLTtbBasicAward =
{
	--Type(2:hk), Genre, Detail, Particular, Level, Series, Lucky, Magiclevel, Date, TaskLinkNum(®Õn sè nv nµy míi cã c¬ héi), TaskValue, Name

	---- edit: Duc Huynh
	[1] = { 0, 6, 1, 12, 0, 5, 0, 0, 0, 0, 240000000, "Bµn Nh­îc T©m Kinh" },
	[2] = { 0, 4, 353, 0, 0, 5, 0, 0, 0, 0, 190000000, "Tinh Hång B¶o Th¹ch" },
	[3] = { 0, 6, 1, 23, 0, 5, 0, 0, 0, 0, 180000000, "ThiÕt La H¸n" },
	[4] = { 0, 6, 1, 15, 0, 5, 0, 0, 0, 0, 170000000, "Phi Phong" },
	[5] = { 0, 6, 0, 3, 0, 5, 0, 0, 0, 0, 170000000, "§¹i Lùc hoµn" },
	[6] = { 0, 6, 0, 6, 0, 5, 0, 0, 0, 0, 160000000, "Phi Tèc hoµn" },
	[7] = { 0, 6, 1, 73, 0, 5, 0, 0, 7, 0, 160000000, "B¸ch Qu¶ Lé" },
	[8] = { 0, 6, 0, 1, 0, 5, 0, 0, 0, 0, 150000000, "Tr­êng MÖnh hoµn" },
	[9] = { 0, 6, 0, 2, 0, 5, 0, 0, 0, 0, 140000000, "Gia Bµo hoµn" },
	[10] = { 0, 6, 0, 4, 0, 5, 0, 0, 0, 0, 130000000, "Cao ThiÓm hoµn" },
	[11] = { 0, 6, 0, 5, 0, 5, 0, 0, 0, 0, 110000000, "Cao Trung hoµn" },
	[12] = { 0, 6, 0, 7, 0, 5, 0, 0, 0, 0, 100000000, "B¨ng Phßng hoµn" },
	[13] = { 0, 6, 0, 8, 0, 5, 0, 0, 0, 0, 100000000, "L«i Phßng hoµn" },
	[14] = { 0, 6, 0, 9, 0, 5, 0, 0, 0, 0, 100000000, "Háa Phßng hoµn" },
	[15] = { 0, 6, 0, 10, 0, 5, 0, 0, 0, 0, 100000000, "§éc Phßng hoµn" },
	[16] = { 0, 6, 0, 20, 0, 5, 0, 0, 0, 0, 100000000, "Mai Kh«i Hoa Vò" },
	[17] = { 0, 6, 0, 11, 0, 5, 0, 0, 0, 0, 90000000, "Ph¸o Hoa" },
	[18] = { 0, 6, 1, 122, 0, 5, 0, 0, 0, 0, 70000000, "Phóc Duyªn Lé (TiÓu)" },

	[19] = { 0, 6, 1, 12, 0, 5, 0, 0, 0, 0, 70000000, "Bµn Nh­îc T©m Kinh" },
	[20] = { 0, 4, 353, 0, 0, 5, 0, 0, 0, 0, 70000000, "Tinh Hång B¶o Th¹ch" },
	[21] = { 0, 6, 1, 23, 0, 5, 0, 0, 0, 0, 60000000, "ThiÕt La H¸n" },
	[22] = { 0, 6, 1, 15, 0, 5, 0, 0, 0, 0, 60000000, "Phi Phong" },
	[23] = { 0, 6, 0, 3, 0, 5, 0, 0, 0, 0, 60000000, "§¹i Lùc hoµn" },
	[24] = { 0, 6, 0, 6, 0, 5, 0, 0, 0, 0, 60000000, "Phi Tèc hoµn" },
	[25] = { 0, 6, 1, 73, 0, 5, 0, 0, 7, 0, 60000000, "B¸ch Qu¶ Lé" },
	[26] = { 0, 6, 0, 1, 0, 5, 0, 0, 0, 0, 56000000, "Tr­êng MÖnh hoµn" },
	[27] = { 0, 6, 0, 2, 0, 5, 0, 0, 0, 0, 56000000, "Gia Bµo hoµn" },

	[28] = { 0, 6, 1, 12, 0, 5, 0, 0, 0, 0, 24000000, "Bµn Nh­îc T©m Kinh" },
	[29] = { 0, 4, 353, 0, 0, 5, 0, 0, 0, 0, 20000000, "Tinh Hång B¶o Th¹ch" },
	[30] = { 0, 6, 1, 23, 0, 5, 0, 0, 0, 0, 60000000, "ThiÕt La H¸n" },
	[31] = { 0, 6, 1, 15, 0, 5, 0, 0, 0, 0, 15000000, "Phi Phong" },
	[32] = { 0, 6, 0, 3, 0, 5, 0, 0, 0, 0, 3500000, "§¹i Lùc hoµn" },
	[33] = { 0, 6, 0, 6, 0, 5, 0, 0, 0, 0, 3000000, "Phi Tèc hoµn" },
	[34] = { 0, 6, 1, 73, 0, 5, 0, 0, 7, 0, 3000000, "B¸ch Qu¶ Lé" },
	[35] = { 0, 6, 0, 1, 0, 5, 0, 0, 0, 0, 1200000, "Tr­êng MÖnh hoµn" },
	[36] = { 0, 6, 0, 2, 0, 5, 0, 0, 0, 0, 1200000, "Gia Bµo hoµn" },
	[37] = { 0, 6, 0, 4, 0, 5, 0, 0, 0, 0, 1000000, "Cao ThiÓm hoµn" },
	[38] = { 0, 6, 0, 5, 0, 5, 0, 0, 0, 0, 800000, "Cao Trung hoµn" },
	[39] = { 0, 6, 0, 7, 0, 5, 0, 0, 0, 0, 800000, "B¨ng Phßng hoµn" },
	[40] = { 0, 6, 0, 8, 0, 5, 0, 0, 0, 0, 800000, "L«i Phßng hoµn" },
	[41] = { 0, 6, 0, 9, 0, 5, 0, 0, 0, 0, 800000, "Háa Phßng hoµn" },
	[42] = { 0, 6, 0, 10, 0, 5, 0, 0, 0, 0, 800000, "§éc Phßng hoµn" },
	[43] = { 0, 6, 0, 20, 0, 5, 0, 0, 0, 0, 30000, "Mai Kh«i Hoa Vò" },
	[44] = { 0, 6, 0, 11, 0, 5, 0, 0, 0, 0, 10000, "Ph¸o Hoa" },
	[45] = { 0, 6, 1, 122, 0, 5, 0, 0, 0, 0, 600000, "Phóc Duyªn Lé (TiÓu)" },


	-- [1  ]={2,0,163,0,0,0,25,0,0,3000,9900000000,"An Bang B¨ng Tinh Th¹ch H¹ng Liªn"},
	-- [2  ]={2,0,189,0,0,0,25,0,0,3000,9000000000,"Nhu T×nh C©n Quèc Nghª Th­êng"},
	-- [3  ]={2,0,166,0,0,0,25,0,0,2500,3600000000,"An Bang Kª HuyÕt Th¹ch Giíi ChØ"},
	-- [4  ]={2,0,165,0,0,0,25,0,0,2000,3000000000,"An Bang §iÒn Hoµng Th¹ch Ngäc Béi"},
	-- [5  ]={2,0,164,0,0,0,25,0,0,2500,3000000000,"An Bang Cóc Hoa Th¹ch ChØ hoµn"},
	-- [6  ]={0,6,1,36,0,5,0,0,0,0,2400000000,"L­u Tinh. §ao ph¸p"},
	-- [7  ]={0,6,1,33,0,5,0,0,0,0,1900000000,"Th¸i Cùc QuyÒn Phæ. QuyÓn 3"},
	-- [8  ]={0,6,1,54,0,5,0,0,0,0,1800000000,"C¸i Bang Ch­ëng Ph¸p"},
	-- [9  ]={2,0,188,0,0,0,25,0,0,600,1800000000,"HiÖp Cèt T×nh ý KÕt"},
	-- [10 ]={2,0,159,0,0,0,25,0,0,1200,1800000000,"§Þnh Quèc ¤ Sa Ph¸t Qu¸n"},
	-- [11 ]={0,6,1,34,0,5,0,0,0,0,1700000000,"Th¸i Cùc KiÕm Phæ. QuyÓn 2"},
	-- [12 ]={0,6,1,43,0,5,0,0,0,0,1700000000,"Nga Mi  PhËt Quang Ch­ëng MËt TÞch"},
	-- [13 ]={2,0,192,0,0,0,25,0,0,600,1600000000,"Nhu T×nh  TuÖ T©m Ngäc Béi"},
	-- [14 ]={0,6,1,38,0,5,0,0,0,0,1600000000,"Thiªn V­¬ng Th­¬ng ph¸p. QuyÓn 2"},
	-- [15 ]={0,6,1,42,0,5,0,0,0,0,1600000000,"DiÖt KiÕm MËt TÞch"},
	-- [16 ]={0,6,1,55,0,5,0,0,0,0,1500000000,"C¸i Bang C«n ph¸p"},
	-- [17 ]={2,0,158,0,0,0,25,0,0,1000,1500000000,"§Þnh Quèc Thanh Sa Tr­êng Sam"},
	-- [18 ]={0,6,1,27,0,5,0,0,0,0,1400000000,"Tô TiÔn thuËt. B¹o Vò Lª Hoa"},
	-- [19 ]={0,6,1,45,0,5,0,0,0,0,1300000000,"Phi §ao thuËt. NhiÕp Hån NguyÖt ¶nh"},
	-- [20 ]={0,6,1,26,0,5,0,0,0,0,1600000000,"Vâ L©m MËt TÞch"},
	-- [21 ]={2,0,161,0,0,0,25,0,0,800,1200000000,"§Þnh Quèc Tö §»ng Hé uyÓn"},
	-- [22 ]={0,6,1,37,0,5,0,0,0,0,1100000000,"Thiªn V­¬ng Chïy Ph¸p. QuyÓn 1"},
	-- [23 ]={0,6,1,40,0,5,0,0,0,0,1000000000,"Thóy Yªn §ao ph¸p"},
	-- [24 ]={0,6,1,41,0,5,0,0,0,0,1000000000,"Thóy Yªn Song ®ao"},
	-- [25 ]={2,0,215,0,0,0,25,0,0,1200,1600000000,"An Bang B¨ng Tinh Th¹ch H¹ng Liªn (nhá)"},
	-- [26 ]={2,0,218,0,0,0,25,0,0,1000,1200000000,"An Bang Kª HuyÕt Th¹ch Giíi ChØ (nhá)"},
	-- [27 ]={0,6,1,46,0,5,0,0,0,0,1000000000,"Phi Tiªu thuËt. Cöu Cung Phi Tinh"},
	-- [28 ]={0,6,1,47,0,5,0,0,0,0,1000000000,"Ngò §éc Ch­ëng Ph¸p. QuyÓn 1"},
	-- [29 ]={2,0,217,0,0,0,25,0,0,800,1200000000,"An Bang §iÒn Hoµng Th¹ch Ngäc Béi (nhá)"},
	-- [30 ]={2,0,216,0,0,0,25,0,0,1000,1200000000,"An Bang Cóc Hoa Th¹ch ChØ hoµn (nhá)"},
	-- [31 ]={0,6,1,51,0,5,0,0,0,0,1000000000,"Ngù L«i thuËt"},
	-- [32 ]={0,6,1,50,0,5,0,0,0,0,900000000,"Ngù Phong thuËt"},
	-- [33 ]={2,0,160,0,0,0,25,0,0,800,900000000,"§Þnh Quèc XÝch Quyªn NhuyÔn Ngoa"},
	-- [34 ]={0,6,1,22,0,5,0,0,0,0,1600000000,"TÈy Tñy Kinh"},
	-- [35 ]={0,6,1,35,0,5,0,0,0,0,900000000,"V©n Long KÝch. M©u ph¸p"},
	-- [36 ]={2,0,185,0,0,0,25,0,0,400,900000000,"HiÖp Cèt ThiÕt HuyÕt Sam"},
	-- [37 ]={2,0,162,0,0,0,25,0,0,800,700000000,"§Þnh Quèc Ng©n Tµm Yªu ®¸i"},
	-- [38 ]={0,6,1,39,0,5,0,0,0,0,700000000,"Thiªn V­¬ng §ao ph¸p.QuyÓn 3"},
	-- [39 ]={0,6,1,28,0,5,0,0,0,0,600000000,"H·m TÜnh thuËt.Lo¹n Hoµn KÝch"},
	-- [40 ]={0,6,1,48,0,5,0,0,0,0,700000000,"Ngò §éc §ao ph¸p. QuyÓn 2"},
	-- [41 ]={0,6,1,49,0,5,0,0,0,0,600000000,"Ngò §éc NhiÕp T©m thuËt. QuyÓn 3"},
	-- [42 ]={0,6,1,52,0,5,0,0,0,0,600000000,"Ngù T©m thuËt"},
	-- [43 ]={0,6,1,53,0,5,0,0,0,0,600000000,"NhiÕp Hån. Chó thuËt"},
	-- [44 ]={2,0,397,0,0,0,25,0,0,600,600000000,"§Þnh Quèc Thanh Sa Tr­êng Sam (nhá)"},
	-- [45 ]={2,0,398,0,0,0,25,0,0,600,600000000,"§Þnh Quèc ¤ Sa Ph¸t Qu¸n (nhá)"},
	-- [46 ]={0,6,1,56,0,5,0,0,0,0,600000000,"ThiÕu L©m QuyÒn Ph¸p. QuyÓn 1"},
	-- [47 ]={0,6,1,57,0,5,0,0,0,0,560000000,"ThiÕu L©m C«n ph¸p. QuyÓn 2"},
	-- [48 ]={0,6,1,58,0,5,0,0,0,0,700000000,"ThiÕu L©m §ao ph¸p. QuyÓn 3"},
	-- [49 ]={2,0,399,0,0,0,25,0,0,400,600000000,"§Þnh Quèc XÝch Quyªn NhuyÔn Ngoa (nhá)"},
	-- [50 ]={2,0,400,0,0,0,25,0,0,400,600000000,"§Þnh Quèc Tö §»ng Hé uyÓn (nhá)"},
	-- [51 ]={2,0,401,0,0,0,25,0,0,400,600000000,"§Þnh Quèc Ng©n Tµm Yªu ®¸i (nhá)"},
	-- [52 ]={0,6,1,59,0,5,0,0,0,0,560000000,"Phæ §é MËt TÞch"},
	-- [53 ]={0,6,1,12,0,5,0,0,0,0,240000000,"Bµn Nh­îc T©m Kinh"},
	-- [54 ]={0,4,353,0,0,5,0,0,0,0,200000000,"Tinh Hång B¶o Th¹ch"},
	-- [55 ]={0,6,1,23,0,5,0,0,0,0,60000000,"ThiÕt La H¸n"},
	-- [56 ]={2,0,191,0,0,0,25,0,0,0,40000000,"Nhu T×nh  Phông Nghi Giíi ChØ"},
	-- [57 ]={2,0,186,0,0,0,25,0,0,0,40000000,"HiÖp Cèt §a T×nh Hoµn"},
	-- [58 ]={2,0,187,0,0,0,25,0,0,0,40000000,"HiÖp Cèt §an T©m Giíi"},
	-- [59 ]={2,0,190,0,0,0,25,0,0,0,40000000,"Nhu T×nh Thôc N÷ H¹ng Liªn"},
	-- [60 ]={0,6,1,71,0,5,0,0,15,0,24000000,"Tiªn Th¶o Lé"},
	-- [61 ]={0,6,1,15,0,5,0,0,0,0,15000000,"Phi Phong"},
	-- [62 ]={0,6,1,72,0,5,0,0,7,0,4000000,"Thiªn s¬n B¶o Lé"},
	-- [63 ]={0,6,0,3,0,5,0,0,0,0,3500000,"§¹i Lùc hoµn"},
	-- [64 ]={0,6,0,6,0,5,0,0,0,0,3000000,"Phi Tèc hoµn"},
	-- [65 ]={0,6,1,73,0,5,0,0,7,0,3000000,"B¸ch Qu¶ Lé"},
	-- [66 ]={0,6,1,124,0,5,0,0,0,0,3000000,"Phóc Duyªn Lé (§¹i)"},
	-- [67 ]={0,6,0,1,0,5,0,0,0,0,1200000,"Tr­êng MÖnh hoµn"},
	-- [68 ]={0,6,0,2,0,5,0,0,0,0,1200000,"Gia Bµo hoµn"},
	-- [69 ]={0,6,1,123,0,5,0,0,0,0,1200000,"Phóc Duyªn Lé (Trung)"},
	-- [70 ]={0,6,0,4,0,5,0,0,0,0,1000000,"Cao ThiÓm hoµn"},
	-- [71 ]={0,6,0,5,0,5,0,0,0,0,800000,"Cao Trung hoµn"},
	-- [72 ]={0,6,0,7,0,5,0,0,0,0,800000,"B¨ng Phßng hoµn"},
	-- [73 ]={0,6,0,8,0,5,0,0,0,0,800000,"L«i Phßng hoµn"},
	-- [74 ]={0,6,0,9,0,5,0,0,0,0,800000,"Háa Phßng hoµn"},
	-- [75 ]={0,6,0,10,0,5,0,0,0,0,800000,"§éc Phßng hoµn"},
	-- [76 ]={0,6,1,122,0,5,0,0,0,0,600000,"Phóc Duyªn Lé (TiÓu)"},
	-- [77 ]={0,6,0,20,0,5,0,0,0,0,30000,"Mai Kh«i Hoa Vò"},
	-- [78 ]={0,6,0,11,0,5,0,0,0,0,10000,"Ph¸o Hoa"},
	-- [79 ]={0,6,1,18,0,5,0,0,0,0,300000,"T©m T©m T­¬ng ¸nh phï"},
	-- [80 ]={0,6,1,125,0,5,0,0,15,0,24000000,"QuÕ Hoa Töu"},
	-- [81 ]={0,6,2,1372,0,5,0,0,7,0,4000000,"B¹ch C©u Hoµn kü n¨ng"},
	-- [82 ]={0,6,2,1182,0,5,0,0,7,0,10000000,"B¹ch C©u Hoµn kü n¨ng ®Æc biÖt"},
	--[x]={0,6,1,154,0,0,0,0,0,0,150000,"Chung Nhò Nguyªn Th¹ch"},
	--[x]={0,6,1,154,0,1,0,0,0,0,150000,"Chung Nhò Nguyªn Th¹ch"},
	--[x]={0,6,1,154,0,2,0,0,0,0,150000,"Chung Nhò Nguyªn Th¹ch"},
	--[x]={0,6,1,154,0,3,0,0,0,0,150000,"Chung Nhò Nguyªn Th¹ch"},
	--[x]={0,6,1,154,0,4,0,0,0,0,150000,"Chung Nhò Nguyªn Th¹ch"},
	--[x]={0,6,1,152,0,0,0,0,0,0,150000,"Phï Dung Nguyªn Th¹ch"},
	--[x]={0,6,1,152,0,1,0,0,0,0,150000,"Phï Dung Nguyªn Th¹ch"},
	--[x]={0,6,1,152,0,2,0,0,0,0,150000,"Phï Dung Nguyªn Th¹ch"},
	--[x]={0,6,1,152,0,3,0,0,0,0,150000,"Phï Dung Nguyªn Th¹ch"},
	--[x]={0,6,1,152,0,4,0,0,0,0,150000,"Phï Dung Nguyªn Th¹ch"},
	--[x]={0,6,1,150,0,0,0,0,0,0,150000,"Khæng T­íc Nguyªn Th¹ch"},
	--[x]={0,6,1,150,0,1,0,0,0,0,150000,"Khæng T­íc Nguyªn Th¹ch"},
	--[x]={0,6,1,150,0,2,0,0,0,0,150000,"Khæng T­íc Nguyªn Th¹ch"},
	--[x]={0,6,1,150,0,3,0,0,0,0,150000,"Khæng T­íc Nguyªn Th¹ch"},
	--[x]={0,6,1,150,0,4,0,0,0,0,150000,"Khæng T­íc Nguyªn Th¹ch"},
	--[x]={0,6,1,147,8,5,0,0,0,0,1260400000,"HuyÒn Tinh cÊp 8"},
	--[x]={0,6,1,147,7,5,0,0,0,0,367700000,"HuyÒn Tinh cÊp 7"},
	--[x]={0,6,1,147,6,5,0,0,0,0,113140000,"HuyÒn Tinh cÊp 6"},
	--[x]={0,6,1,147,5,5,0,0,0,0,33000000,"HuyÒn Tinh cÊp 5"},
	--[x]={0,6,1,147,4,5,0,0,0,0,9000000,"HuyÒn Tinh cÊp 4"},
	--[x]={0,6,1,147,3,5,0,0,0,0,2250000,"HuyÒn tinh cÊp 3"},
	--[x]={0,6,1,147,2,5,0,0,0,0,500000,"HuyÒn tinh cÊp 2"},
	--[x]={0,6,1,147,1,5,0,0,0,0,100000,"HuyÒn tinh cÊp 1"},
	--[x]={0,6,1,153,0,5,0,0,0,0,50000,"Chu Sa Nguyªn Kho¸ng"},
	--[x]={0,6,1,151,0,5,0,0,0,0,50000,"MËt Ng©n Nguyªn Kho¸ng"},
	--[x]={0,6,1,149,0,5,0,0,0,0,50000,"HuyÒn ThiÕt Nguyªn Kho¸ng"},
};

--B¶ng vËt phÈm th­ëng theo mèc sè nv;
DLTtbLinkAward =
{
	--Num	Type	Genre	Detail	Particular	Level	Series	Lucky	Date	Count    IsHKMP   Level

	---- edit: Duc Huynh
	{ 200,  0, 6, 1,  71,   0, 5, 0, 15 },             --Tiªn Th¶o Lé
	{ 400,  0, 6, 1,  4979, 0, 5, 0, 15 },             -- Hép quµ d· tÈu 400
	{ 600,  0, 6, 2,  4979, 0, 5, 0, 15 },             -- Hép quµ d· tÈu 600
	{ 800,  0, 6, 1,  71,   0, 5, 0, 15 },             --Tiªn Th¶o Lé
	{ 1000, 0, 6, 1,  71,   0, 5, 0, 15 },             --Tiªn Th¶o Lé
	{ 1200, 0, 6, 1,  71,   0, 5, 0, 15 },             --Tiªn Th¶o Lé
	{ 1400, 0, 6, 1,  71,   0, 5, 0, 15 },             --Tiªn Th¶o Lé

	{ 1500, 0, 6, 3,  4979, 0, 5, 0, 15, nil, nil, 80 }, -- Hép quµ d· tÈu 1500
	{ 1600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 80 }, --Tiªn Th¶o Lé
	{ 1800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 80 }, --Tiªn Th¶o Lé
	{ 1900, 0, 6, 4,  4979, 0, 5, 0, 15, nil, nil, 80 }, -- Hép quµ d· tÈu 1900
	{ 2000, 0, 6, 5,  4979, 0, 5, 0, 15, nil, nil, 90 }, -- Hép quµ d· tÈu 2000
	{ 2200, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 90 }, --Tiªn Th¶o Lé
	{ 2400, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 90 }, --Tiªn Th¶o Lé
	{ 2600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 90 }, --Tiªn Th¶o Lé
	{ 2800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 90 }, --Tiªn Th¶o Lé
	{ 3000, 0, 6, 6,  4979, 0, 5, 0, 15, nil, nil, 95 }, -- Hép quµ d· tÈu 3000
	{ 3200, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 95 }, --Tiªn Th¶o Lé
	{ 3400, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 95 }, --Tiªn Th¶o Lé
	{ 3600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 95 }, --Tiªn Th¶o Lé
	{ 3800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 95 }, --Tiªn Th¶o Lé
	{ 4000, 0, 6, 7,  4979, 0, 5, 0, 15, nil, nil, 100 }, -- Hép quµ d· tÈu 4000
	{ 4200, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 100 }, --Tiªn Th¶o Lé
	{ 4400, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 100 }, --Tiªn Th¶o Lé
	{ 4600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 100 }, --Tiªn Th¶o Lé
	{ 4800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 100 }, --Tiªn Th¶o Lé 	
	{ 5000, 0, 6, 8,  4979, 0, 5, 0, 15, nil, nil, 105 }, -- Hép quµ d· tÈu 5000
	{ 5200, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 105 }, --Tiªn Th¶o Lé
	{ 5400, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 105 }, --Tiªn Th¶o Lé
	{ 5600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 105 }, --Tiªn Th¶o Lé
	{ 5800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 105 }, --Tiªn Th¶o Lé 	
	{ 6000, 0, 6, 9,  4979, 0, 5, 0, 15, nil, nil, 110 }, -- Hép quµ d· tÈu 6000
	{ 6200, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 110 }, --Tiªn Th¶o Lé
	{ 6400, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 110 }, --Tiªn Th¶o Lé
	{ 6600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 110 }, --Tiªn Th¶o Lé
	{ 6800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 110 }, --Tiªn Th¶o Lé 	
	{ 7000, 0, 6, 10, 4979, 0, 5, 0, 15, nil, nil, 115 }, -- Hép quµ d· tÈu 7000
	{ 7200, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 115 }, --Tiªn Th¶o Lé
	{ 7400, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 115 }, --Tiªn Th¶o Lé
	{ 7600, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 115 }, --Tiªn Th¶o Lé
	{ 7800, 0, 6, 1,  71,   0, 5, 0, 15, nil, nil, 115 }, --Tiªn Th¶o Lé 	
	{ 8000, 0, 6, 11, 4979, 0, 5, 0, 15, nil, nil, 115 }, -- Hép quµ d· tÈu 8000




	-- {200,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {400,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {600,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {800,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {1000,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {1200,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {1400,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {1500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {1600,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {1800,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {2000,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {2200,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {2400,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {2600,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {2800,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {3000,2,0,{158,162},0,0,0,30,0},--§Þnh Quèc
	-- {3200,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {3400,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {3600,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {3800,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {4000,2,0,{163,166},0,0,0,30,0},--An Bang
	-- {4200,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {4400,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {4600,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {4800,0,6,1,71,0,5,0,15},--Tiªn Th¶o Lé
	-- {5000,nil,nil,nil,nil,nil,nil,nil,nil,0,1},--HKMP param11 = pricetype = 1
	-- {5500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {6000,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {6500,2,0,{402,406},0,0,0,30,0},--§Þnh Quèc cùc phÈm
	-- {7000,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {7500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {8000,2,0,{209,212},0,0,0,30,0},--An Bang Hoµn Mü
	-- {8500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {9000,2,0,{193,201},0,0,0,30,0},--Kim Quang
	-- {9500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {10000,nil,nil,nil,nil,nil,nil,nil,nil,0,2},--HK V« Danh param11 = pricetype = 2
	-- {10500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {11000,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {11500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {12000,0,6,7,1782,0,5,0,0},--Tinh hång lÔ bao
	-- {12500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {13000,0,6,2,2849,0,5,0,0},--HK quy nguyªn
	-- {13500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {14000,0,6,1,2849,0,5,0,0},--HK gi¸m ®Þnh
	-- {14500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {15000,2,0,{209,212},0,0,0,30,0},--An Bang Hoµn Mü
	-- {15500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {16000,2,0,{433,436},0,0,0,30,0},--Hång ¶nh Hoµn Mü
	-- {16500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {17000,0,6,{4,6},1782,0,5,0,0},--CÈm nang Thñy Tinh
	-- {17500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {18000,nil,nil,nil,nil,nil,nil,nil,nil,0,3},--Hoµn Mü HKMP param11 = pricetype = 3
	-- {18500,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {19000,0,4,{238,240},0,0,5,0,0},--Thñy Tinh
	-- {19500,0,6,1,398,0,5,0,0},--ThÇn bÝ kho¸ng th¹ch
	-- {20000,0,6,1,1310,0,5,0,0},--M¶nh Bæ Thiªn Th¹ch (®¹i)
	-- {20500,0,6,1,398,0,5,0,0},--ThÇn bÝ kho¸ng th¹ch
	-- {21000,0,6,{4,6},1782,0,5,0,0},--CÈm nang Thñy Tinh
	-- {21500,0,6,1,398,0,5,0,0},--ThÇn bÝ kho¸ng th¹ch
	-- {22000,0,6,2,1531,0,5,0,0},--§å phæ Tinh X¶o V« Danh Giíi
	-- {22500,0,6,1,398,0,5,0,0},--ThÇn bÝ kho¸ng th¹ch
	-- {23000,0,6,2,4567,0,5,0,0},--B¹ch Kim ChuyÓn Ho¸n Phï
	-- {23500,0,6,1,398,0,5,0,0},--ThÇn bÝ kho¸ng th¹ch
	-- {24000,0,6,2,1706,0,5,0,0},--Cùc PhÈm LuyÖn Kim Phï
};

function g_DLTGivePrizeLoop(nTaskNum, nMoreTimes) -- mçi 5 nv trong ngµy sÏ ®c c¸i nµy; nMoreTimes: sè lÇn t¨ng thªm 10nv
	---- edit: Duc huynh
	if (HaveSpace(1, 1) == 1) then
		local idx = AddItemTemp(0, 6, 1, 4983, 0, 5, 1); --- viªn kinh nghiÖm da tÈu
		SetItemDate(idx, 3 * 24 * 60);
		AddItemIdx(idx);
		Talk(1, "", "Chóc mõng ®¹i hiÖp nhËn phÇn th­ëng chuçi d· tÈu " .. MAX_TASKLINK_ADAY .. " nhiÖm vô liªn tôc ");
		WriteLog("DaTau_FinishTask_" .. date("%Y-%m-%d") .. ".txt", format("acc<%s> role<%s>", GetAccount(), GetName()));
	end

	--if(ENABLE_EVENT_3004 == 1) then
	--	if(CalcFreeItemCell() < 1) then
	--		Talk(1,"","B¹n kh«ng ®ñ « trèng nªn sÏ mÊt phÇn th­ëng sù kiÖn.")
	--		return
	--	end

	--	local idx = AddItemTemp(0,6,3,4985,0,5,50)
	--	LockItem(idx)
	--	SetItemDate(idx,EVENT_3004_ENDDATE[1],EVENT_3004_ENDDATE[2],EVENT_3004_ENDDATE[3],EVENT_3004_ENDDATE[4],EVENT_3004_ENDDATE[5])
	--	AddItemIdx(idx);
	--	Msg2Player("NhËn ®­îc 50 c¸i hu©n ch­¬ng chiÕn c«ng")
	--end
	----- kÕt thóc -----


	-- event 01/06/2026 (th­ëng 1 nv)
	-- Duc_GiveKeoCam(10);
	-- Duc_GiveThiep(10, 10);
	-- local idscprit = FileName2Id("\\script\\event\\01062026\\helper.lua");
	-- ExeScript(idscprit,0,"Duc_GiveKeoCam",10);---- Npc sù kiÖn 0106
	-- ExeScript(idscprit,0,"Duc_GiveThiep",10,10);---- Npc sù kiÖn 0106

	-- local idscprit = FileName2Id("\\script\\event\\vulan\\helper.lua");
	-- ExeScript(idscprit,0,"Duc_GiveBongHong",10);---- Npc sù kiÖn 0106
	-- ExeScript(idscprit,0,"Duc_GiveThiep",10,10);---- Npc sù kiÖn 0106
	local qkidscprit = FileName2Id("\\script\\event\\quockhanh0209\\helper.lua");
	ExeScript(qkidscprit, 0, "QKHelper_Add", 8); -- 1 Ngoi Sao moi moc nhiem vu ngay
	if nTaskNum >= 30 then
		local idscprit = FileName2Id("\\script\\event\\quockhanh0209\\helper.lua");
		ExeScript(idscprit, 0, "QKHelper_Add", 3);
	end
	-- local idscprit = FileName2Id("\\script\\event\\trungthu\\helper.lua");
	-- ExeScript(idscprit,0,"DucTT_GiveHatSen",10);---- Npc sù kiÖn trung thu
	-- ExeScript(idscprit,0,"DucTT_GiveLongDen",10,10);---- Npc sù kiÖn trung thu
	----- kÕt thóc -----


	-- SetTask(TASKVALUE_NEWPOINT, GetTask(TASKVALUE_NEWPOINT) + 3)
	-- Msg2Player("B¹n nhËn ®­îc <color=yellow>3 ®iÓm Tinh Lùc")
	-- Msg2Player(1683,"",nTaskNum)

	-- if(nMoreTimes > 0 and nTaskNum >= 20) then
	-- if(HaveSpace(1,1) == 1) then
	-- if(nTaskNum == 20) then
	-- gAddStack_PTC(3)	--sl: 3 c¸i phiÕu trß ch¬i
	-- else
	-- gAddStack_PTC(5)	--sl: 5 c¸i phiÕu trß ch¬i
	-- end
	-- end
	-- end
	give_event_datau()
end;
